
'''
class
init 은 생성자.
자동으로 생성되는 것. init 함수에 정의된 self를 제외한 변수의 갯수만큼
입력이 되어야만 오류가 안난다. 
Java 에서의 class와 같은 개념. 
class명은 그 class에 해당하는 인스턴스를 만들어 출력한다.
이때, 인스턴스는 각각 자신의 멤버변수를 가진다.
멤버 변수는 각 인스턴스에 딸려 다니는 것이다.
클래스 외부에서 특정 인스턴스에만 멤버변수를 추가하는 것이 가능하다.
그렇다고 해서 다른 모든 인스턴스들도 새로운 멤버변수 공간을 가지는 것이 아니다.
self는 해당 객체를 의미한다. self가 없으면 외부에서 입력방은 값 등을 가리키는 것.
class 내부에서 선언한 함수의 첫 입력은 self

메소드
'''
print('asdf')

# super을 쓸 때에는 super() 를 쓰고, __init__의 매개변수에 self를 없이 쓴다.
# super은 상속하고 있는 클래스를 의미한다.
# 그러면 다중상속이라서 여러개의 부모 클래스가 있으면 super는 누구를 뜻하나?
# 먼저 상속한 클래스만 상속한다. 따라서 다중 상속 시에는 super쓰지말고, class이름 명시!
#    